MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_q.c
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_q.c
  * @brief   This file provides Q services.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32_hal.h"

/**
  * @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if (defined(USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1))

/** @addtogroup Q
  * @{
  */

/** @defgroup Q_Introduction Q Introduction
  * @{

Q handles linked-list operations.

A queue is a set of linked nodes, each containing data and a link to the next node.

The following operations are supported: initialize and de-initialize the queue, and insert, remove,
 or replace nodes at the head, tail, or any position.

A linked list can be made circular, looping back to any position in the queue.

One queue can also be inserted into another, which merges them.

Create nodes externally using drivers such as DMA, SD, or MMC,
using functions like HAL_DMA_FillNodeConfig.

  */
/**
  * @}
  */

/** @defgroup Q_How_To_Use Q How To Use
  * @{

# How to use the Q HAL module driver

## The Q HAL module can be used as follows:

Q is the abbreviation for Queue. It is an entity that contains a node or a set of nodes linked to each other.
Each node contains a data set and a link to the next node.

Use this utility HAL driver only with HAL modules that support the linked-list feature.
This module is activated automatically when the USE_HAL_PPP_LINKEDLIST compilation flag is enabled in
stm32ynxx_hal_conf.h.
Use this module to build a linked-list Q executable for masters that support the linked-list feature.
To build Q(s) compatible with different linked-list masters, this module supports two addressing modes:
   - Direct addressing mode: node link addresses represent the physical node address.
   - Base offset addressing mode: node link addresses represent the offset of the node from the Q head node
     address.
This module supports singly linked-list Q nodes.
Behavior is not guaranteed if a Q is modified outside this module.

This module provides six API sets that allow you to:

1. Initialize and de-initialize the logical Q object:
   - Initialize the logical Q object using information provided by any HAL peripheral module that supports the linked
     list feature. When initialized, the Q is ready to apply any operation provided by this module.
   - De-initialize the logical Q object and unlink all Q node(s). When de-initialized, reuse the Q object for the same
     or another master executor.

2. Insert a new node in a Q:
   - Insert a new node into a Q at any position using the following function models:
     - Generic new node insertion function that allows you to add a new node at any selected Q position.
       - This functionality is ensured by HAL_Q_InsertNode() function. The p_node parameter allows you to specify where
         the new node is inserted.
         - When p_node is null, the new node is placed at the head of Q.
         - When p_node is not null, the new node is placed directly after p_node. If p_node is not found within the Q,
           the function returns an error and the Q is not modified.
     - New head node insertion function that allows you to add a new node as the head node of a Q.
       - This functionality is ensured by HAL_Q_InsertNode_Head() function.
     - New tail node insertion function that allows you to add a new node as the tail node of a Q.
       - This functionality is ensured by HAL_Q_InsertNode_Tail() function.
   - Do not add a new node when the selected Q is circular.
   - Prefer the tail node insertion model function to reduce footprint.

3. Remove an existing node from a Q:
   - Remove any existing node from a Q using the following function models:
     - Generic node removal function that allows you to remove any existing node from a Q.
       - This functionality is ensured by HAL_Q_RemoveNode() function.
         - The p_node parameter allows you to select the node to be removed. This function returns an error when p_node
           is not found within the Q or p_node is null.
     - Head node removal function that allows you to remove the head node from a Q.
       - This functionality is ensured by HAL_Q_RemoveNode_Head() function.
     - Tail node removal function that allows you to remove the tail node from a Q.
       - This functionality is ensured by HAL_Q_RemoveNode_Tail() function.
   - Do not remove an existing node when the selected Q is circular.
   - When successfully removed, the removed node can be reused later.

4. Replace an existing node in a Q:
   - Replace any existing node with a new node in a Q using the following function models:
     - Generic node replacement function that allows you to replace any existing node with a new node in a Q.
       - This functionality is ensured by HAL_Q_ReplaceNode() function. The p_old_node parameter allows you to specify
         the node to be replaced.
         - When p_old_node is not null, p_new_node replaces p_old_node. If p_old_node is not found within the Q, the
           function returns an error and the Q is not modified.
     - Head node replacement function that allows you to replace the existing head node with a new head node in a Q.
       - This functionality is ensured by HAL_Q_ReplaceNode_Head() function.
     - Tail node replacement function that allows you to replace the existing tail node with a new tail node in a Q.
       - This functionality is ensured by HAL_Q_ReplaceNode_Tail() function.
   - Do not replace an existing node when the selected Q is circular.
   - When successfully replaced, the replaced node can be reused later.

