MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_q.c
5. Insert a source Q into a destination Q:
   - Insert a source Q into a destination Q at any position using the following function models:
     - Generic source Q insertion function that allows you to insert source Q node(s) at any selected destination Q
       position.
       - This functionality is ensured by HAL_Q_InsertNode() function. The p_node parameter allows you to specify where
         the source Q node(s) are inserted.
         - When p_node is null, the source Q node(s) are placed at the head of the destination Q.
         - When p_node is not null, the source Q node(s) are placed directly after p_node. If p_node is not found
           within the destination Q, the function returns an error and the source and destination Qs are not modified.
     - Head source Q insertion function that allows you to insert source Q node(s) before all the destination Q node(s).
       - This functionality is ensured by HAL_Q_InsertNode_Head() function.
     - Tail source Q insertion function that allows you to insert source Q node(s) after all the destination Q node(s).
       - This functionality is ensured by HAL_Q_InsertNode_Tail() function.
   - Do not add source Q node(s) to destination Q node(s) when any Q is circular.
   - Prefer the tail Q insertion model function to reduce footprint.
   - When successfully inserted, the destination Q contains the source Q nodes and destination Q nodes, and the source Q
     is cleared and can be reused later without needing to reinitialize it.

6. Set and clear a circular link on a non-empty Q:
   - Set a circular link to any Q node using the following function models:
     - Generic circular link Q setting function that allows you to set a circular link at any non-empty Q position.
       - This functionality is ensured by HAL_Q_SetCircularLinkQ() function. The p_node parameter allows you to specify
         the first circular node (node linked to Q tail node). This function returns an error when p_node is not found
         within the Q or p_node is null.
     - Head circular link Q setting function that allows you to set a circular link to the head node of Q.
       - This functionality is ensured by HAL_Q_SetCircularLinkQ_Head() function.
     - Tail circular link Q setting function that allows you to set a circular link to the tail node of Q.
       - This functionality is ensured by HAL_Q_SetCircularLinkQ_Tail() function.
   - Clear a circular link from a Q.
     - This functionality is ensured by HAL_Q_ClearCircularLinkQ() function.
  */
/**
  * @}
  */

/** @defgroup Q_Configuration_Table Q Configuration Table
  * @{
## Configuration inside the Q module

Config definitions       | Description     | Default value | Note
------------------------ | --------------- | ------------- | ---------------------------------------------------------
USE_ASSERT_DBG_PARAM     | from IDE        |     None      | When defined, enable parameter asserts.
USE_HAL_CHECK_PARAM      | from hal_conf.h |     0U        | It allows using run-time checks on parameters.
USE_HAL_{PPP}_LINKEDLIST | from hal_conf.h |     0U        | It allows using the PPP in linked-list mode.
USE_HAL_Q_CIRCULAR_LINK  | from hal_ppp.h  |     0U        | It allows using a circular-link queue.
  */
/**
  * @}
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private functions -------------------------------------------------------------------------------------------------*/
/** @defgroup Q_Private_Functions Q Private Functions
  * @{
  */
static void Q_UnlinkNodes(hal_q_t *p_q, uint32_t head_node_addr);
static void Q_ResetInfo(hal_q_t *p_q);
static hal_status_t Q_FindNode(const hal_q_t *p_q, uint32_t head_node_addr, uint32_t node_addr,
                               uint32_t *p_prev_node_addr);
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup Q_Exported_Functions
  * @{
  */

/** @addtogroup Q_Exported_Functions_Group1 Q Initialization and de-initialization functions
  * @{
This section provides functions to initialize and de-initialize the logical Q object:
- Call the function HAL_Q_Init() to initialize the logical Q object and associate its operation information.
- Call the function HAL_Q_DeInit() to de-initialize the logical Q object and unlink its nodes.
  */

/**
  * @brief  Initialize the logical Q object and associate its operation information.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_desc_ops        Pointer to a hal_q_desc_ops_t structure that contains Q operation information.
  * @note                     The p_desc_ops is a constant provided by HAL PPP modules that support the linked-list
  *                           feature, titled HAL_PPP_{mode}_DescOps or HAL_PPP_DescOps.
  * @retval HAL_OK            In the case of a valid initialization.
  * @retval HAL_INVALID_PARAM In the case of an invalid parameter.
  */
hal_status_t HAL_Q_Init(hal_q_t *p_q, const hal_q_desc_ops_t *p_desc_ops)
{
  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_desc_ops != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_q == NULL) || (p_desc_ops == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  p_desc_ops->p_get_node_info(&p_q->next_addr_offset, &p_q->addr_mode);

  p_q->p_head_node           = NULL;
  p_q->p_tail_node           = NULL;
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  p_q->p_first_circular_node = NULL;
#endif /* USE_HAL_Q_CIRCULAR_LINK */
  p_q->node_nbr              = 0U;
  p_q->p_set_node            = p_desc_ops->p_set_node;
  p_q->p_get_node            = p_desc_ops->p_get_node;

  return HAL_OK;
}

/**
  * @brief De-initialize the logical Q object and unlink its node(s).
  * @param p_q Pointer to a hal_q_t structure that contains Q information.
  */
void HAL_Q_DeInit(hal_q_t *p_q)
{
  uint32_t head;

