MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_q.c
  /* Empty Q */
  if (p_q->p_head_node == NULL)
  {
    p_q->p_head_node = p_new_node;
    p_q->p_tail_node = p_new_node;
  }
  /* Non-empty Q */
  else
  {
    p_q->p_set_node(head, tail, new_node, offset);
    p_q->p_tail_node = p_new_node;
  }

  p_q->node_nbr++;

  return HAL_OK;
}
/**
  * @}
  */


/** @addtogroup Q_Exported_Functions_Group3 Q node removing functions
  * @{
This section provides functions to remove any existing node from a Q:
- Call the function HAL_Q_RemoveNode() to remove any existing node from a Q.
- Call the function HAL_Q_RemoveNode_Head() to remove the head node from a Q.
- Call the function HAL_Q_RemoveNode_Tail() to remove the tail node from a Q.
  */

/**
  * @brief  Remove a node from the Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_node            Pointer to the previous node.
  * @retval HAL_OK            In the case of a successful node removal.
  * @retval HAL_INVALID_PARAM In the case of an invalid parameter.
  * @retval HAL_ERROR         In the case of a node not found in the Q.
  */
hal_status_t HAL_Q_RemoveNode(hal_q_t *p_q, const void *p_node)
{
  uint32_t prev;
  uint32_t head;
  uint32_t tail;
  uint32_t node;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head   = (uint32_t)p_q->p_head_node;
  tail   = (uint32_t)p_q->p_tail_node;
  node   = (uint32_t)p_node;
  offset = p_q->next_addr_offset;

  /* Delete head node */
  if (p_node == p_q->p_head_node)
  {
    if (p_q->node_nbr == 1U)
    {
      Q_ResetInfo(p_q);
    }
    else
    {
      /* Set the new head node */
      p_q->p_head_node = (void *)(p_q->p_get_node(head, head, offset));
      p_q->p_set_node(0U, node, 0U, offset);
    }
  }
  else
  {
    /* Delete tail node */
    if (p_node == p_q->p_tail_node)
    {
      prev = tail;
    }
    /* Delete middle node */
    else
    {
      prev = node;
    }

    if (Q_FindNode(p_q, head, prev, &prev) != HAL_OK)
    {
      return HAL_ERROR;
    }

    /* Delete tail node */
    if (p_node == p_q->p_tail_node)
    {
      /* Set the new tail node */
      p_q->p_tail_node = (void *)prev;
      p_q->p_set_node(0U, prev, 0U, offset);
    }
    /* Delete middle node */
    else
    {
      p_q->p_set_node(head, prev, p_q->p_get_node(head, node, offset), offset);
      p_q->p_set_node(0U, node, 0U, offset);
    }
  }

  p_q->node_nbr--;

  return HAL_OK;
}

/**
  * @brief  Remove the head node of the Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @retval HAL_OK            In the case of a successful head node removal.
  * @retval HAL_ERROR         In the case of a node not found.
  * @retval HAL_INVALID_PARAM In the case of an invalid parameter.
  */
hal_status_t HAL_Q_RemoveNode_Head(hal_q_t *p_q)
{
  uint32_t head;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_head_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q->p_head_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  offset = p_q->next_addr_offset;

  if (p_q->node_nbr == 1U)
  {
    Q_ResetInfo(p_q);
  }
  else
  {
    /* Store the old head node */
    head = (uint32_t)p_q->p_head_node;

    /* Set the new head node */
    p_q->p_head_node = (void *)(p_q->p_get_node(head, head, offset));
    p_q->p_set_node(0U, head, 0U, offset);
  }

  p_q->node_nbr--;

  return HAL_OK;
}

/**
  * @brief  Remove the tail node of the Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @retval HAL_OK            In the case of a successful tail node removal.
  * @retval HAL_ERROR         In the case of a node not found.
  * @retval HAL_INVALID_PARAM In the case of an invalid parameter.
  */
hal_status_t HAL_Q_RemoveNode_Tail(hal_q_t *p_q)
{
  uint32_t prev = 0U;
  uint32_t head;
  uint32_t tail;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_tail_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q->p_tail_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head   = (uint32_t)p_q->p_head_node;
  tail   = (uint32_t)p_q->p_tail_node;
  offset = p_q->next_addr_offset;

  if (p_q->node_nbr == 1U)
  {
    Q_ResetInfo(p_q);
  }
  else
  {
    if (Q_FindNode(p_q, head, tail, &prev) != HAL_OK)
    {
      return HAL_ERROR;
    }

    /* Set the new tail node */
    p_q->p_tail_node = (void *)prev;
    p_q->p_set_node(0U, prev, 0U, offset);
  }

  p_q->node_nbr--;

  return HAL_OK;
}
/**
  * @}
  */


/** @addtogroup Q_Exported_Functions_Group4 Q node replacing functions
  * @{
This section provides functions to replace any existing node in a Q:
- Call the function HAL_Q_ReplaceNode() to replace any existing node with a new node in a Q.
- Call the function HAL_Q_ReplaceNode_Head() to replace the head node in a Q.
- Call the function HAL_Q_ReplaceNode_Tail() to replace the tail node in a Q.
  */

/**
  * @brief  Replace a node in the Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_old_node        Pointer to an old node.
  * @param  p_new_node        Pointer to a new node.
  * @retval HAL_OK            In the case of a successful node replacement.
  * @retval HAL_INVALID_PARAM In the case of an invalid parameter.
  * @retval HAL_ERROR         In the case of the old node not found in the Q.
  */
hal_status_t HAL_Q_ReplaceNode(hal_q_t *p_q, const void *p_old_node, void *p_new_node)
{
  uint32_t prev;
  uint32_t head;
  uint32_t tail;
  uint32_t new_node;
  uint32_t old_node;
  uint32_t offset;

