MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_q.c
  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_old_node != NULL);
  ASSERT_DBG_PARAM(p_new_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_old_node == NULL) || (p_new_node == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head     = (uint32_t)p_q->p_head_node;
  tail     = (uint32_t)p_q->p_tail_node;
  new_node = (uint32_t)p_new_node;
  old_node = (uint32_t)p_old_node;
  offset   = p_q->next_addr_offset;

  if (p_old_node == p_q->p_head_node)
  {
    if (p_q->node_nbr == 1U)
    {
      p_q->p_tail_node = p_new_node;
    }
    else
    {
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
      if (p_q->addr_mode == HAL_Q_ADDRESSING_DIRECT)
      {
        p_q->p_set_node(head, new_node, p_q->p_get_node(head, head, offset), offset);
      }
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

      p_q->p_set_node(0U, head, 0U, offset);
    }

    p_q->p_head_node = p_new_node;
  }
  else
  {
    if (p_old_node == p_q->p_tail_node)
    {
      prev = tail;
    }
    else
    {
      prev = old_node;
    }

    if (Q_FindNode(p_q, head, prev, &prev) != HAL_OK)
    {
      return HAL_ERROR;
    }

    if (p_old_node == p_q->p_tail_node)
    {
      p_q->p_set_node(head, prev, new_node, offset);
      p_q->p_tail_node = p_new_node;
    }
    else
    {
      p_q->p_set_node(head, new_node, p_q->p_get_node(head, old_node, offset), offset);
      p_q->p_set_node(head, prev, new_node, offset);
      p_q->p_set_node(0U, old_node, 0U, offset);
    }
  }

  return HAL_OK;
}

/**
  * @brief  Replace the head node in the Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_new_node        Pointer to a new node.
  * @retval HAL_OK            In the case of a successful head node replacement.
  * @retval HAL_ERROR         In the case of the old node not found in the Q.
  * @retval HAL_INVALID_PARAM In the case of an invalid parameter.
  */
hal_status_t HAL_Q_ReplaceNode_Head(hal_q_t *p_q, void *p_new_node)
{
  uint32_t head;
  uint32_t new_node;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_head_node != NULL);
  ASSERT_DBG_PARAM(p_new_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_q->p_head_node == NULL) || (p_new_node == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head     = (uint32_t)p_q->p_head_node;
  new_node = (uint32_t)p_new_node;
  offset   = p_q->next_addr_offset;

  if (p_q->node_nbr == 1U)
  {
    p_q->p_tail_node = p_new_node;
  }
  else
  {
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
    if (p_q->addr_mode == HAL_Q_ADDRESSING_DIRECT)
    {
      p_q->p_set_node(head, new_node, p_q->p_get_node(head, head, offset), offset);
    }
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

    p_q->p_set_node(0U, head, 0U, offset);
  }

  p_q->p_head_node = p_new_node;

  return HAL_OK;
}

/**
  * @brief  Replace the tail node in the Q.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_new_node        Pointer to a new node.
  * @retval HAL_OK            In the case of a successful tail node replacement.
  * @retval HAL_ERROR         In the case of the old node not found in the Q.
  * @retval HAL_INVALID_PARAM In the case of an invalid parameter.
  */
hal_status_t HAL_Q_ReplaceNode_Tail(hal_q_t *p_q, void *p_new_node)
{
  uint32_t prev = 0U;
  uint32_t head;
  uint32_t tail;
  uint32_t new_node;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_new_node != NULL);
  ASSERT_DBG_PARAM(p_q->p_tail_node != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if ((p_q->p_tail_node == NULL) || (p_new_node == NULL))
  {
    return HAL_INVALID_PARAM;
  }
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if (p_q->p_first_circular_node != NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  head     = (uint32_t)p_q->p_head_node;
  tail     = (uint32_t)p_q->p_tail_node;
  new_node = (uint32_t)p_new_node;
  offset   = p_q->next_addr_offset;

  if (p_q->node_nbr == 1U)
  {
    p_q->p_head_node = p_new_node;
  }
  else
  {
    /* Find the tail previous node */
    if (Q_FindNode(p_q, head, tail, &prev) != HAL_OK)
    {
      return HAL_ERROR;
    }

    p_q->p_set_node(head, prev, new_node, offset);
  }

  p_q->p_tail_node = p_new_node;

  return HAL_OK;
}
/**
  * @}
  */


/** @addtogroup Q_Exported_Functions_Group5 Q inserting Q functions
  * @{
This section provides functions to insert a source Q at any destination Q position:
- Call the function HAL_Q_InsertQ() to insert a source Q at any destination Q position.
- Call the function HAL_Q_InsertQ_Head() to insert a source Q before all destination Q node(s).
- Call the function HAL_Q_InsertQ_Tail() to insert a source Q after all destination Q node(s).
  */

/**
  * @brief  Insert a source Q directly after the previous node in the destination Q.
  * @param  p_dest_q Pointer to a hal_q_t structure that contains Q information.
  * @param  p_src_q  Pointer to a hal_q_t structure that contains Q information.
  * @param  p_node   Pointer to the previous node. When null, the source Q node(s) are placed at the head of the
  *                 destination Q.
  * @retval HAL_OK            In the case of a successful source Q insertion in the destination Q.
  * @retval HAL_INVALID_PARAM In the case of an invalid parameter.
  * @retval HAL_ERROR         In the case of the p_prev_node not found in the Q.
  */
hal_status_t HAL_Q_InsertQ(hal_q_t *p_dest_q, hal_q_t *p_src_q, const void *p_node)
{
  uint32_t src_head;
  uint32_t dest_head;
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
  uint32_t src_tail;
  uint32_t dest_tail;
  uint32_t offset;
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */
  uint32_t node_addr;

