MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_q.c
  ASSERT_DBG_PARAM(p_src_q != NULL);
  ASSERT_DBG_PARAM(p_dest_q != NULL);
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  ASSERT_DBG_PARAM(p_src_q->p_first_circular_node == NULL);
  ASSERT_DBG_PARAM(p_dest_q->p_first_circular_node == NULL);
#endif /* USE_HAL_Q_CIRCULAR_LINK */

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  if ((p_src_q->p_first_circular_node != NULL) || (p_dest_q->p_first_circular_node != NULL))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_Q_CIRCULAR_LINK */
#endif /* USE_HAL_CHECK_PARAM */

  src_head_addr  = (uint32_t)p_src_q->p_head_node;
  dest_head_addr = (uint32_t)p_dest_q->p_head_node;
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
  dest_tail_addr = (uint32_t)p_dest_q->p_tail_node;
  offset         = p_dest_q->next_addr_offset;
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

  /* Check if source Q is empty */
  if (p_src_q->node_nbr == 0U)
  {
    return HAL_OK;
  }

  /* Empty destination Q */
  if (p_dest_q->p_head_node == NULL)
  {
    p_dest_q->p_head_node   = p_src_q->p_head_node;
    p_dest_q->p_tail_node   = p_src_q->p_tail_node;
  }
  /* Non-empty destination Q */
  else
  {
#if (USE_HAL_Q_DIRECT_ADDR_MODE) && (USE_HAL_Q_DIRECT_ADDR_MODE == 1)
    if (p_dest_q->addr_mode == HAL_Q_ADDRESSING_DIRECT)
    {
      /* Link source Q tail node address to destination Q head node address */
      p_src_q->p_set_node(dest_head_addr, dest_tail_addr, src_head_addr, offset);
    }
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

    /* Set destination Q tail node as source Q tail node */
    p_dest_q->p_tail_node = p_src_q->p_tail_node;
  }

  /* Set node number of new Q */
  p_dest_q->node_nbr += p_src_q->node_nbr;

  Q_ResetInfo(p_src_q);
  p_src_q->node_nbr = 0U;

  return HAL_OK;
}
/**
  * @}
  */

#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
/** @addtogroup Q_Exported_Functions_Group6 Q circularizing Q functions
  * @{
This section provides functions to set and clear a circular link to any node in a non-empty Q:
- Call the function HAL_Q_SetCircularLinkQ() to set a circular link to any node in a non-empty Q.
- Call the function HAL_Q_SetCircularLinkQ_Head() to set a circular link to the head Q node.
- Call the function HAL_Q_SetCircularLinkQ_Tail() to set a circular link to the tail Q node.
- Call the function HAL_Q_ClearCircularLinkQ() to clear any existing circular link in a Q.
  */

/**
  * @brief  Set a circular link to any selected Q node.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @param  p_node            Pointer to the first circular node.
  * @retval HAL_OK            In the case of Q circularization.
  * @retval HAL_INVALID_PARAM In the case of an invalid parameter.
  * @retval HAL_ERROR         In case of p_node node not found in the Q.
  */
hal_status_t HAL_Q_SetCircularLinkQ(hal_q_t *p_q, void *p_node)
{
  uint32_t head;
  uint32_t tail;
  uint32_t node;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_head_node != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q->p_head_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  head   = (uint32_t)p_q->p_head_node;
  tail   = (uint32_t)p_q->p_tail_node;
  node   = (uint32_t)p_node;
  offset = p_q->next_addr_offset;

  if (Q_FindNode(p_q, head, node, NULL) == HAL_OK)
  {
    /* Link the tail node to the p_node */
    p_q->p_set_node(head, tail, node, offset);

    /* Update first circular node in Q */
    p_q->p_first_circular_node = p_node;
  }
  else
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @brief Set Q circular mode.
  * @param p_q                Pointer to a hal_q_t structure that contains Q information.
  * @retval HAL_OK            In the case of Q circularized on the head.
  * @retval HAL_INVALID_PARAM In the case of an invalid parameter.
  */
hal_status_t HAL_Q_SetCircularLinkQ_Head(hal_q_t *p_q)
{
  uint32_t head;
  uint32_t tail;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_head_node != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q->p_head_node == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  head   = (uint32_t)p_q->p_head_node;
  tail   = (uint32_t)p_q->p_tail_node;
  offset = p_q->next_addr_offset;

  /* Link the tail node to the head node */
  p_q->p_set_node(head, tail, head, offset);

  /* Update first circular node in Q */
  p_q->p_first_circular_node = p_q->p_head_node;

  return HAL_OK;
}

/**
  * @brief  Set Q circular mode.
  * @param  p_q               Pointer to a hal_q_t structure that contains Q information.
  * @retval HAL_OK            In the case of Q circularized on the tail.
  * @retval HAL_INVALID_PARAM In the case of an invalid parameter.
  */
hal_status_t HAL_Q_SetCircularLinkQ_Tail(hal_q_t *p_q)
{
  uint32_t head;
  uint32_t tail;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_head_node != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q->p_tail_node ==  NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  head   = (uint32_t)p_q->p_head_node;
  tail   = (uint32_t)p_q->p_tail_node;
  offset = p_q->next_addr_offset;

  /* Link the tail node to itself */
  p_q->p_set_node(head, tail, tail, offset);

  /* Update first circular node in Q */
  p_q->p_first_circular_node = p_q->p_tail_node;

  return HAL_OK;
}

/**
  * @brief Clear circular mode of the Q.
  * @param p_q     Pointer to a hal_q_t structure that contains Q information.
  * @retval HAL_OK In the case of Q being cleared.
  */
hal_status_t HAL_Q_ClearCircularLinkQ(hal_q_t *p_q)
{
  uint32_t tail;
  uint32_t offset;

  ASSERT_DBG_PARAM(p_q != NULL);
  ASSERT_DBG_PARAM(p_q->p_head_node != NULL);

#if defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_q->p_tail_node ==  NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

