MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_q.c
  tail   = (uint32_t)p_q->p_tail_node;
  offset = p_q->next_addr_offset;

  /* Clear circular link within tail node */
  p_q->p_set_node(0U, tail, 0U, offset);

  /* Update first circular node in Q */
  p_q->p_first_circular_node = NULL;

  return HAL_OK;
}
#endif /* USE_HAL_Q_CIRCULAR_LINK */
/**
  * @}
  */

/**
  * @}
  */


/** @addtogroup Q_Private_Functions
  * @{
  */

/**
  * @brief Unlink all Q nodes.
  * @param p_q            Pointer to a hal_q_t structure that contains Q information.
  * @param head_node_addr Head node address.
  */
static void Q_UnlinkNodes(hal_q_t *p_q, uint32_t head_node_addr)
{
  uint32_t current_node = head_node_addr;
  uint32_t offset       = p_q->next_addr_offset;
  uint32_t next_node;

  /* Repeat for all Q nodes */
  while (p_q->node_nbr > 0U)
  {
    next_node = p_q->p_get_node(head_node_addr, current_node, offset);
    p_q->p_set_node(0U, current_node, 0U, offset);
    current_node = next_node;
    p_q->node_nbr--;
  }
}

/**
  * @brief Reset Q information.
  * @param p_q Pointer to a hal_q_t structure that contains Q information.
  */
static void Q_ResetInfo(hal_q_t *p_q)
{
  p_q->p_head_node           = NULL;
  p_q->p_tail_node           = NULL;
#if defined(USE_HAL_Q_CIRCULAR_LINK) && (USE_HAL_Q_CIRCULAR_LINK == 1)
  p_q->p_first_circular_node = NULL;
#endif /* USE_HAL_Q_CIRCULAR_LINK */
}

/**
  * @brief Find a node in the Q.
  * @param p_q              Pointer to a hal_q_t structure that contains Q information.
  * @param head_node_addr   Head node address.
  * @param node_addr        Node address to find.
  * @param p_prev_node_addr Pointer to the previous node address.
  * @retval HAL_OK          In the case of a found node.
  * @retval HAL_ERROR       In the case of the node not found in the Q.
  */
static hal_status_t Q_FindNode(const hal_q_t *p_q, uint32_t head_node_addr, uint32_t node_addr,
                               uint32_t *p_prev_node_addr)
{
  uint32_t current_node_addr = head_node_addr;
  uint32_t offset            = p_q->next_addr_offset;
  uint32_t current_node_idx  = 0U;

  /* Loop while node not found */
  while ((current_node_addr != node_addr) && (current_node_idx < p_q->node_nbr))
  {
    if (p_prev_node_addr != NULL)
    {
      *p_prev_node_addr = current_node_addr;
    }

    current_node_addr = p_q->p_get_node(head_node_addr, current_node_addr, offset);
    current_node_idx++;
  }

  if ((current_node_idx == p_q->node_nbr) && (current_node_addr != node_addr))
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @}
  */

/**
  * @}
  */
#endif /* USE_HAL_Q_DIRECT_ADDR_MODE */

/**
  * @}
  */
